In [81]:
import pandas as pd
from sqlalchemy import create_engine


engine = create_engine("postgresql://postgres@localhost:5432/bike_store")

# data
df_customers = pd.read_csv('./data/customers.csv')
df_products = pd.read_csv('./data/products.csv')
df_orders = pd.read_csv('./data/orders.csv')
df_order_items = pd.read_csv('./data/order_items.csv')
df_brands = pd.read_csv('./data/brands.csv')
df_categories = pd.read_csv('./data/categories.csv')
df_stores = pd.read_csv('./data/stores.csv')
df_staffs = pd.read_csv('./data/staffs.csv')
df_stocks = pd.read_csv('./data/stocks.csv')

# PostgreSQL
df_customers.to_sql('customers', engine, if_exists='replace', index=False)
df_products.to_sql('products', engine, if_exists='replace', index=False)
df_orders.to_sql('orders', engine, if_exists='replace', index=False)
df_order_items.to_sql('order_items', engine, if_exists='replace', index=False)
df_brands.to_sql('brands', engine, if_exists='replace', index=False)
df_categories.to_sql('categories', engine, if_exists='replace', index=False)
df_stores.to_sql('stores', engine, if_exists='replace', index=False)
df_staffs.to_sql('staffs', engine, if_exists='replace', index=False)
df_stocks.to_sql('stocks', engine, if_exists='replace', index=False)

print("✅ All tables loaded successfully!")

✅ All tables loaded successfully!

In [82]:
import pandas as pd

query = """
SELECT
    c.customer_id,
    c.first_name,
    c.last_name,
    COUNT(o.order_id) AS total_orders
FROM
    customers c
JOIN
    orders o ON c.customer_id = o.customer_id
GROUP BY
    c.customer_id,
    c.first_name,
    c.last_name
ORDER BY
    total_orders DESC
LIMIT 20;
"""

result = pd.read_sql(query, engine)
result

    customer_id first_name last_name  total_orders
0             3     Tameka    Fisher             3
1            46     Monika      Berg             3
2            15     Linnie    Branch             3
3            61    Elinore   Aguilar             3
4            50  Cleotilde     Booth             3
5            17      Caren  Stephens             3
6            32    Araceli    Golden             3
7            77       Keri   Bridges             3
8            18  Georgetta    Hardin             3
9             7    Latasha      Hays             3
10           16     Emmitt   Sanchez             3
11           43    Mozelle    Carter             3
12            8  Jacquline    Duncan             3
13           24     Corene      Wall             3
14           66     Lorrie    Becker             3
15           53  Saturnina    Garner             3
16           10    Pamelia    Newman             3
17           64     Bobbie    Foster             3
18          116    Merlene    Vinson             3
19           11    Deshawn   Mendoza             3

What type of product, was the most popular?

In [83]:
query_pr = """
SELECT
    p.product_id,
    p.product_name,
    b.brand_name,
    p.list_price,
    COUNT(oi.order_id) AS total_orders
FROM
    products p
JOIN
    order_items oi ON p.product_id = oi.product_id 
JOIN
    brands b ON p.brand_id = b.brand_id
GROUP BY
    p.product_id,
    p.product_name,
    b.brand_name,
    p.list_price
ORDER BY
    total_orders DESC
LIMIT 20;
"""

result_pro = pd.read_sql(query_pr, engine)
result_pro

,product_id,product_name,brand_name,list_price,total_orders
0,6,Surly Ice Cream Truck Frameset - 2016,Surly,469.99,110
1,12,Electra Townie Original 21D - 2016,Electra,549.99,104
2,13,Electra Cruiser 1 (24-Inch) - 2016,Electra,269.99,103
3,7,Trek Slash 8 27.5 - 2016,Trek,3999.99,101
4,9,Trek Conduit+ - 2016,Trek,2999.99,101
5,23,Electra Girl's Hawaii 1 (20-inch) - 2015/2016,Electra,299.99,100
6,25,Electra Townie Original 7D - 2015/2016,Electra,499.99,98
7,10,Surly Straggler - 2016,Surly,1549.00,97
8,4,Trek Fuel EX 8 29 - 2016,Trek,2899.99,97
9,11,Surly Straggler 650b - 2016,Surly,1680.99,97
10,16,Electra Townie Original 7D EQ - 2016,Electra,599.99,95
11,22,Electra Girl's Hawaii 1 (16-inch) - 2015/2016,Electra,269.99,94
12,15,Electra Moto 1 - 2016,Electra,529.99,91
13,17,Pure Cycles Vine 8-Speed - 2016,Pure Cycles,429.00,91
14,5,Heller Shagamaw Frame - 2016,Heller,1320.99,91
15,26,Electra Townie Original 7D EQ - 2016,Electra,599.99,90
16,21,Electra Cruiser 1 (24-Inch) - 2016,Electra,269.99,90
17,18,Pure Cycles Western 3-Speed - Women's - 2015/2016,Pure Cycles,449.00,89
18,24,Electra Townie Original 21D - 2016,Electra,549.99,89
19,14,Electra Girl's Hawaii 1 (16-inch) - 2015/2016,Electra,269.99,86

How much money each product generated in sales?

In [84]:
query_rev = """
SELECT
    p.product_id,
    p.product_name,
    b.brand_name,
    p.list_price,
    COUNT(oi.order_id) AS total_orders,
    (p.list_price * COUNT(oi.order_id)) AS total_revenue
FROM
    products p
JOIN
    order_items oi ON p.product_id = oi.product_id 
JOIN
    brands b ON p.brand_id = b.brand_id
GROUP BY
    p.product_id,
    p.product_name,
    b.brand_name,
    p.list_price
ORDER BY
    total_revenue DESC
LIMIT 20;
"""

result_rev = pd.read_sql(query_rev, engine)
result_rev

,product_id,product_name,brand_name,list_price,total_orders,total_revenue
0,7,Trek Slash 8 27.5 - 2016,Trek,3999.99,101,403998.99
1,9,Trek Conduit+ - 2016,Trek,2999.99,101,302998.99
2,4,Trek Fuel EX 8 29 - 2016,Trek,2899.99,97,281299.03
3,11,Surly Straggler 650b - 2016,Surly,1680.99,97,163056.03
4,56,Trek Domane SLR 6 Disc - 2017,Trek,5499.99,28,153999.72
5,8,Trek Remedy 29 Carbon Frameset - 2016,Trek,1799.99,85,152999.15
6,10,Surly Straggler - 2016,Surly,1549.00,97,150253.00
7,43,Trek Fuel EX 9.8 27.5 Plus - 2017,Trek,5299.99,25,132499.75
8,58,Trek Madone 9.2 - 2017,Trek,4999.99,26,129999.74
9,61,Trek Powerfly 8 FS Plus - 2017,Trek,4999.99,25,124999.75
10,51,Trek Silque SLR 8 Women's - 2017,Trek,6499.99,19,123499.81
11,5,Heller Shagamaw Frame - 2016,Heller,1320.99,91,120210.09
12,50,Trek Silque SLR 7 Women's - 2017,Trek,5999.99,20,119999.80
13,40,Trek Fuel EX 9.8 29 - 2017,Trek,4999.99,21,104999.79
14,62,Trek Boone 7 - 2017,Trek,3499.99,25,87499.75
15,3,Surly Wednesday Frameset - 2016,Surly,999.99,86,85999.14
16,49,Trek Domane SL 6 - 2017,Trek,3499.99,22,76999.78
17,47,Trek Remedy 9.8 - 2017,Trek,5299.99,14,74199.86
18,63,Trek Boone Race Shop Limited - 2017,Trek,3499.99,21,73499.79
19,55,Trek Domane S 6 - 2017,Trek,2699.99,26,70199.74

Which state have the highest number of orders?

In [85]:
query_state = """
SELECT
    c.state,
    p.product_id,
    p.product_name,
    COUNT(oi.order_id) AS total_orders
FROM
    products p
JOIN 
    order_items oi ON p.product_id = oi.product_id
JOIN 
    orders o ON oi.order_id = o.order_id
JOIN 
    customers c ON o.customer_id = c.customer_id
GROUP BY
    c.state,
    p.product_id,
    p.product_name
ORDER BY
    total_orders DESC
LIMIT 20;
"""

result_state = pd.read_sql(query_state, engine)
result_state

,state,product_id,product_name,total_orders
0,NY,6,Surly Ice Cream Truck Frameset - 2016,73
1,NY,12,Electra Townie Original 21D - 2016,72
2,NY,13,Electra Cruiser 1 (24-Inch) - 2016,71
3,NY,23,Electra Girl's Hawaii 1 (20-inch) - 2015/2016,70
4,NY,7,Trek Slash 8 27.5 - 2016,69
5,NY,10,Surly Straggler - 2016,67
6,NY,25,Electra Townie Original 7D - 2015/2016,67
7,NY,21,Electra Cruiser 1 (24-Inch) - 2016,67
8,NY,11,Surly Straggler 650b - 2016,66
9,NY,16,Electra Townie Original 7D EQ - 2016,66
10,NY,5,Heller Shagamaw Frame - 2016,66
11,NY,26,Electra Townie Original 7D EQ - 2016,65
12,NY,24,Electra Townie Original 21D - 2016,64
13,NY,18,Pure Cycles Western 3-Speed - Women's - 2015/2016,64
14,NY,9,Trek Conduit+ - 2016,63
15,NY,14,Electra Girl's Hawaii 1 (16-inch) - 2015/2016,62
16,NY,4,Trek Fuel EX 8 29 - 2016,62
17,NY,22,Electra Girl's Hawaii 1 (16-inch) - 2015/2016,61
18,NY,17,Pure Cycles Vine 8-Speed - 2016,61
19,NY,8,Trek Remedy 29 Carbon Frameset - 2016,59

Which state placed the most orders in total?

In [86]:

query_state = """
SELECT
    c.state,
    COUNT(o.order_id) AS total_orders
FROM
    customers c
JOIN
    orders o ON c.customer_id = o.customer_id
GROUP BY
    c.state
ORDER BY
    total_orders DESC;
    """

result_state = pd.read_sql(query_state, engine)
result_state

  state  total_orders
0    NY          1093
1    CA           348
2    TX           174

Which stores handled the largest number of orders?

In [87]:
query_stores = """
SELECT
    s.store_name,
    s.city,
    COUNT(o.order_id) AS total_orders
FROM
    stores s 
JOIN
    orders o ON s.store_id = o.store_id
GROUP BY
    s.store_name,
    s.city
ORDER BY
    total_orders DESC;  
"""



result_stores = pd.read_sql(query_stores, engine)
result_stores

         store_name        city  total_orders
0     Baldwin Bikes     Baldwin          1093
1  Santa Cruz Bikes  Santa Cruz           348
2     Rowlett Bikes     Rowlett           174

Total sales value per store

In [88]:
query_stores_rev = """
SELECT
    s.store_name,
    s.city,
    COUNT(o.order_id) AS total_orders,
    SUM(oi.quantity * oi.list_price) AS total_revenue
FROM
    stores s 
JOIN
    orders o ON s.store_id = o.store_id
JOIN
    order_items oi ON o.order_id = oi.order_id
GROUP BY
    s.store_name,
    s.city
ORDER BY
    total_orders DESC;  
"""



result_stores_rev = pd.read_sql(query_stores_rev, engine)
result_stores_rev

         store_name        city  total_orders  total_revenue
0     Baldwin Bikes     Baldwin          3195     5826242.21
1  Santa Cruz Bikes  Santa Cruz          1006     1790145.91
2     Rowlett Bikes     Rowlett           521      962600.76

Most valuable customers (by spend)

In [89]:
query_cust = """
SELECT
    c.customer_id,
    c.first_name,
    c.last_name,
    c.city,
    COUNT(o.order_id) AS total_orders,
    SUM(oi.quantity * oi.list_price) AS total_spend_per_customer
FROM
    customers c 
JOIN
    orders o ON c.customer_id = o.customer_id
JOIN
    order_items oi ON o.order_id = oi.order_id
GROUP BY
    c.customer_id,
    c.first_name,
    c.last_name,
    c.city
ORDER BY
    total_spend_per_customer DESC
LIMIT 20;
"""



result_cust = pd.read_sql(query_cust, engine)
result_cust

,customer_id,first_name,last_name,city,total_orders,total_spend_per_customer
0,10,Pamelia,Newman,Monroe,11,37801.84
1,75,Abby,Gamble,Amityville,7,37500.89
2,94,Sharyn,Hopkins,Baldwinsville,10,37138.86
3,6,Lyndsey,Bean,Fairport,11,35857.86
4,16,Emmitt,Sanchez,New York,12,34503.82
5,73,Melanie,Hayes,Liverpool,7,34390.88
6,1,Debra,Burks,Orchard Park,11,30645.87
7,61,Elinore,Aguilar,San Angelo,10,29661.83
8,93,Corrina,Sawyer,Troy,8,29214.89
9,122,Shena,Carter,Howard Beach,4,27618.95
10,12,Robby,Sykes,Hempstead,8,27157.88
11,1224,Abram,Copeland,Harlingen,5,26913.92
12,9,Genoveva,Baldwin,Port Washington,9,26679.78
13,3,Tameka,Fisher,Redondo Beach,13,26249.81
14,66,Lorrie,Becker,Garland,9,25940.88
15,85,Teofila,Fischer,Huntington Station,10,25772.86
16,43,Mozelle,Carter,Houston,11,25382.84
17,35,Guillermina,Noble,Baldwinsville,8,24779.86
18,58,Damien,Dorsey,Central Islip,10,24686.84
19,4,Daryl,Spence,Uniondale,9,24198.88

Products that were never ordered

In [90]:
query_= """
SELECT
    p.product_id,
    p.product_name,
    b.brand_name,
    p.list_price,
    oi.quantity
FROM
    products p
JOIN
    order_items oi ON oi.product_id = p.product_id
JOIN
    brands b ON b.brand_id = p.brand_id
GROUP BY
    p.product_id,
    p.product_name,
    b.brand_name,
    p.list_price,
    oi.quantity
ORDER BY
   oi.quantity DESC
LIMIT 20;
"""



result_never_buy = pd.read_sql(query_never_buy, engine)
result_never_buy

,product_id,product_name,brand_name,list_price,quantity
0,17,Pure Cycles Vine 8-Speed - 2016,Pure Cycles,429.00,1
1,20,Electra Townie Original 7D EQ - Women's - 2016,Electra,599.99,1
2,14,Electra Girl's Hawaii 1 (16-inch) - 2015/2016,Electra,269.99,1
3,16,Electra Townie Original 7D EQ - 2016,Electra,599.99,1
4,18,Pure Cycles Western 3-Speed - Women's - 2015/2016,Pure Cycles,449.00,1
5,19,Pure Cycles William 3-Speed - 2016,Pure Cycles,449.00,1
6,12,Electra Townie Original 21D - 2016,Electra,549.99,1
7,13,Electra Cruiser 1 (24-Inch) - 2016,Electra,269.99,1
8,15,Electra Moto 1 - 2016,Electra,529.99,1
9,7,Trek Slash 8 27.5 - 2016,Trek,3999.99,1
10,3,Surly Wednesday Frameset - 2016,Surly,999.99,1
11,8,Trek Remedy 29 Carbon Frameset - 2016,Trek,1799.99,1
12,5,Heller Shagamaw Frame - 2016,Heller,1320.99,1
13,9,Trek Conduit+ - 2016,Trek,2999.99,1
14,2,Ritchey Timberwolf Frameset - 2016,Ritchey,749.99,1
15,10,Surly Straggler - 2016,Surly,1549.00,1
16,6,Surly Ice Cream Truck Frameset - 2016,Surly,469.99,1
17,11,Surly Straggler 650b - 2016,Surly,1680.99,1
18,4,Trek Fuel EX 8 29 - 2016,Trek,2899.99,1
19,21,Electra Cruiser 1 (24-Inch) - 2016,Electra,269.99,1

Products that were never ordered

In [91]:
query_never= """
SELECT
    p.product_id,
    p.product_name
FROM
    products p
LEFT JOIN
    order_items oi ON p.product_id = oi.product_id
WHERE
    oi.product_id IS NULL;
"""


result_never = pd.read_sql(query_never, engine)
result_never

    product_id                                    product_name
0            1                                 Trek 820 - 2016
1          121                   Surly Krampus Frameset - 2018
2          125                    Trek Kids' Dual Sport - 2018
3          154           Trek Domane SLR 6 Disc Women's - 2018
4          195            Electra Townie Go! 8i Ladies' - 2018
5          267                Trek Precaliber 12 Girl's - 2018
6          284    Electra Savannah 1 (20-inch) - Girl's - 2018
7          291  Electra Sweet Ride 1 (20-inch) - Girl's - 2018
8          316            Trek Checkpoint ALR 4 Women's - 2019
9          317                    Trek Checkpoint ALR 5 - 2019
10         318            Trek Checkpoint ALR 5 Women's - 2019
11         319             Trek Checkpoint SL 5 Women's - 2019
12         320                     Trek Checkpoint SL 6 - 2019
13         321             Trek Checkpoint ALR Frameset - 2019

In [92]:
pd.read_sql("SELECT * FROM orders LIMIT 5;", engine)

,order_id,customer_id,order_status,order_date,required_date,shipped_date,store_id,staff_id
0,1,259,4,2016-01-01,2016-01-03,2016-01-03,1,2
1,2,1212,4,2016-01-01,2016-01-04,2016-01-03,2,6
2,3,523,4,2016-01-02,2016-01-05,2016-01-03,2,7
3,4,175,4,2016-01-03,2016-01-04,2016-01-05,1,3
4,5,1324,4,2016-01-03,2016-01-06,2016-01-06,2,6

Monthly Sales Analysis

In [ ]:
query_monthly= """
SELECT
    DATE_TRUNC('month', TO_DATE(o.order_date, 'YYYY-MM_DD')) AS month,
    COUNT(o.order_id) AS total_orders
FROM
    orders o
GROUP BY
    month
ORDER BY
    month;
"""
result_monthly = pd.read_sql(query_monthly, engine)
result_monthly

                        month  total_orders
0   2016-01-01 00:00:00+01:00            50
1   2016-02-01 00:00:00+01:00            49
2   2016-03-01 00:00:00+01:00            55
3   2016-04-01 00:00:00+02:00            43
4   2016-05-01 00:00:00+02:00            51
5   2016-06-01 00:00:00+02:00            45
6   2016-07-01 00:00:00+02:00            50
7   2016-08-01 00:00:00+02:00            63
8   2016-09-01 00:00:00+02:00            67
9   2016-10-01 00:00:00+02:00            64
10  2016-11-01 00:00:00+01:00            43
11  2016-12-01 00:00:00+01:00            55
12  2017-01-01 00:00:00+01:00            50
13  2017-02-01 00:00:00+01:00            57
14  2017-03-01 00:00:00+01:00            67
15  2017-04-01 00:00:00+02:00            57
16  2017-05-01 00:00:00+02:00            57
17  2017-06-01 00:00:00+02:00            63
18  2017-07-01 00:00:00+02:00            52
19  2017-08-01 00:00:00+02:00            65
20  2017-09-01 00:00:00+02:00            53
21  2017-10-01 00:00:00+02:00            65
22  2017-11-01 00:00:00+01:00            55
23  2017-12-01 00:00:00+01:00            47
24  2018-01-01 00:00:00+01:00            52
25  2018-02-01 00:00:00+01:00            35
26  2018-03-01 00:00:00+01:00            68
27  2018-04-01 00:00:00+02:00           125
28  2018-06-01 00:00:00+02:00             1
29  2018-07-01 00:00:00+02:00             4
30  2018-08-01 00:00:00+02:00             2
31  2018-09-01 00:00:00+02:00             1
32  2018-10-01 00:00:00+02:00             1
33  2018-11-01 00:00:00+01:00             2
34  2018-12-01 00:00:00+01:00             1

The most popular products in a given city

In [ ]:

query_pop_city= """
SELECT
    c.city,
    p.product_id,
    p.product_name,
    COUNT(oi.product_id) AS total_products_sold
FROM
    customers c 
JOIN
    orders o ON c.customer_id = o.customer_id
JOIN
    order_items oi ON o.order_id = oi.order_id
JOIN
    products p ON oi.product_id = p.product_id
GROUP BY
    c.city,
    p.product_id,
    p.product_name
ORDER BY
    total_products_sold DESC
LIMIT 20;
"""



result_pop_city = pd.read_sql(query_pop_city, engine)
result_pop_city

,city,product_id,product_name,total_products_sold
0,Encino,2,Ritchey Timberwolf Frameset - 2016,5
1,Brooklyn,12,Electra Townie Original 21D - 2016,4
2,Orchard Park,8,Trek Remedy 29 Carbon Frameset - 2016,4
3,South El Monte,3,Surly Wednesday Frameset - 2016,4
4,Bay Shore,13,Electra Cruiser 1 (24-Inch) - 2016,4
5,San Angelo,4,Trek Fuel EX 8 29 - 2016,3
6,Central Islip,21,Electra Cruiser 1 (24-Inch) - 2016,3
7,Orchard Park,24,Electra Townie Original 21D - 2016,3
8,Canandaigua,23,Electra Girl's Hawaii 1 (20-inch) - 2015/2016,3
9,Plainview,8,Trek Remedy 29 Carbon Frameset - 2016,3
10,Scarsdale,12,Electra Townie Original 21D - 2016,3
11,Scarsdale,19,Pure Cycles William 3-Speed - 2016,3
12,Canyon Country,4,Trek Fuel EX 8 29 - 2016,3
13,Hollis,66,Sun Bicycles Revolutions 24 - 2017,3
14,Garden City,25,Electra Townie Original 7D - 2015/2016,3
15,Spring Valley,6,Surly Ice Cream Truck Frameset - 2016,3
16,Santa Monica,6,Surly Ice Cream Truck Frameset - 2016,3
17,South El Monte,25,Electra Townie Original 7D - 2015/2016,3
18,Kingston,95,"Electra Girl's Hawaii 1 16"" - 2017",3
19,Banning,6,Surly Ice Cream Truck Frameset - 2016,3

In [ ]:
query_po= """
SELECT
    s.city,
    p.product_name,
    COUNT(oi.order_id) AS total_orders
FROM
    stores s
JOIN
    orders o ON s.store_id = o.store_id
JOIN
    order_items oi ON o.order_id = oi.order_id
JOIN
    products p ON oi.product_id = p.product_id
GROUP BY
    s.city, p.product_name
ORDER BY
    total_orders DESC;
"""

result_po = pd.read_sql(query_po, engine)
result_po

           city                                   product_name  total_orders
0       Baldwin             Electra Cruiser 1 (24-Inch) - 2016           138
1       Baldwin             Electra Townie Original 21D - 2016           136
2       Baldwin           Electra Townie Original 7D EQ - 2016           131
3       Baldwin  Electra Girl's Hawaii 1 (16-inch) - 2015/2016           123
4       Baldwin          Surly Ice Cream Truck Frameset - 2016            73
..          ...                                            ...           ...
617  Santa Cruz          Electra Cruiser Lux 3i Ladies' - 2018             1
618  Santa Cruz                Trek Procaliber Frameset - 2018             1
619     Rowlett                     Surly Ogre Frameset - 2017             1
620     Rowlett                       Trek Fuel EX 8 29 - 2018             1
621     Rowlett                        Trek Domane AL 2 - 2018             1

[622 rows x 3 columns]

Average order value per customer

In [ ]:
query_avg= """
SELECT
    c.customer_id,
    c.first_name,
    c.last_name,
    AVG(oi.quantity *oi.list_price) AS avg_order_value
FROM
    customers c
JOIN
    orders o ON c.customer_id = o.customer_id
JOIN
    order_items oi ON o.order_id = oi.order_id

GROUP BY
    c.customer_id,
    c.first_name,
    c.last_name
ORDER BY
    avg_order_value DESC
LIMIT 20;
"""

result_avg = pd.read_sql(query_avg, engine)
result_avg

    customer_id first_name  last_name  avg_order_value
0           905        Hae    Ramirez     12999.980000
1           329    Marilyn      Frank      9999.980000
2          1445      Ester    Acevedo      9999.980000
3           390     Lorrie    Pollard      7999.980000
4          1370       Rona      Rojas      7999.980000
5           692   Dorothea      Chang      7274.490000
6           503      Marlo  Jefferson      6969.980000
7           122      Shena     Carter      6904.737500
8          1005   Ruthanne     Franco      6893.316667
9           700    Collene       Knox      6750.980000
10          339     Tamela    Harrell      6733.316667
11          289   Charmain    Webster      6499.986667
12          108       Shae    Hickman      6421.316667
13         1195   Chantell    Bridges      6329.985000
14          320       Aron    Wiggins      6235.485000
15          184      Klara    Stanley      6142.986667
16          534  Alejandro      Haney      6043.316667
17         1284    Shanice     Spears      5999.985000
18         1014       Ling     Newman      5999.980000
19          100     Kellie     Franco      5999.980000

Average number of items per order

In [ ]:
query_avg_ord= """ 
SELECT
    ROUND(AVG(item_count), 2) AS avg_items_per_order
FROM (
    SELECT
        o.order_id,
        COUNT(oi.item_id) AS item_count
    FROM
        orders o
    JOIN
        order_items oi ON o.order_id = oi.order_id
    GROUP BY
        o.order_id
) sub;
"""

result_avg_ord = pd.read_sql(query_avg_ord, engine)
result_avg_ord

   avg_items_per_order
0                 2.92